'''
一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
'''

from math import sqrt,ceil
'''
    完全平方数开平方后是浮点型整数, 例如 sqrt(16) = 4.0000
    浮点型整数向上取整仍然为 4 并不发生改变; 而+1之后开方会变成小数,例如 sqrt(17) = 4.123105
    向上取整为 5 .
'''
for i in range(-99,10000):
    if ceil(sqrt(i+100)) < ceil(sqrt(i+101)):
        if ceil(sqrt(i+268)) < ceil(sqrt(i + 269)):
            print("这个数是%d" % i)

print("-"*10+'方法2'+"-"*10)
'''
像上面的方法效率太低：假设这个数为X,则：
x+100=n*n
x+100+168=m*m
所以m*m-n*n=168
又因为100*100-99*99=10000-9801=199 > 168,所以m，一定小于100,那么x的值小于10000
m*m = n*n+168,n<100
所以m>sqrt(168),即m>13
'''
for m in range(13,100):
    n = int(sqrt(m*m-168))
    if m*m == n*n+168:
        num = m*m-100-168
        print("这个数是%d" % num)



